# GetVPCropObject

## Description
Gets the specified viewport's crop object, if any.

```pascal
FUNCTION GetVPCropObject(viewportHandle : HANDLE) : HANDLE;
```

```python

def vs.GetVPCropObject(viewportHandle):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE||

## Version
Availability: from VectorWorks11.0
## Category
* Objects - Groups